Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: Each barcode has a number system digit, followed by five manufacturer code digits and five product code digits.
ja: 各バーコードは、１つの「ナンバーシステム」桁、それに続く５桁の「製造者コード」そして５桁の「商品コード」を持ちます。

source: Each build target (such as an app bundle or framework) in Xcode is treated as a separate module in Swift.
ja: Xcodeでの各ビルドターゲット（例えばアプリ・バンドルまたはフレームワーク）は、スウィフトにおいて別々のモジュールとみなされます。

source: Each case can also specify that it stores values of a given type.
ja: 各ケース節は、また、それが特定の型の値を格納することを示すことができます。

source: Each case must have a unique name and be assigned a unique raw value.
ja: それぞれのケース節は、固有な名前を持ち固有な生の値を割り当てられなければなりません。

source: Each channel has an integer audio level between 0 and 10 inclusive.
ja: 各チャンネルは、0から10を含むまでの整数オーディオ・レベルがあります。

source: Each element of the tuple can be tested against a different value or interval of values.
ja: タプルの各要素は、ある異なる値または値の区間に対して試験されることができます。

source: Each enumeration definition defines a new type.
ja: 各列挙定義は、ある新しい型を定義します。

source: Each example below shows a different representation of the following string, which is made up of the characters D, o, g, ‼ (DOUBLE EXCLAMATION MARK, or Unicode scalar U+203C), and the 🐶 character (DOG FACE, or Unicode scalar U+1F436):
ja: 以下の各例は、次の文字列の異なる表現を示します、それは文字D、o、g、‼（DOUBLE EXCLAMATION MARK、またはユニコードスカラーU+203C）、そして🐶文字（DOG FACEまたはユニコードスカラーU+1F436）から成ります：

source: Each expression can have an optional identifier before it, separated by a colon (:).
ja: 各式はそれの前に、コロン（:）で区切られる任意の識別子を持つことができます。

source: Each form encodes the string in small chunks known as code units.
ja: 各方式は、文字列を、符号単位として知られている小さいかたまりで符号化します。

source: Each function parameter has both an argument label and a parameter name.
ja: 関数パラメーターそれぞれは、引数ラベルとパラメーター名の両方を持ちます。

source: Each identifier in a tuple expression must be unique within the scope of the tuple expression.
ja: あるタプル式の中の各識別子は、そのタプル式のスコープ内で特有でなければなりません。

source: Each instance of Person has a single stored property called fullName, which is of type String.
ja: Personの各インスタンスは、fullNameと呼ばれる１つの格納プロパティを持ちます、それは、型Stringです。

source: Each item in a capture list is a pairing of the weak or unowned keyword with a reference to a class instance (such as self) or a variable initialized with some value (such as delegate = self.delegate).
ja: 捕獲リストの各項目は、weakまたはunownedキーワードと、クラスインスタンスへの参照（例えばself）またはなんらかの値で初期化された変数（例えばdelegate = self.delegate）を対にしたものです。

source: Each item in a protocol composition list is one of the following; the list can contain at most one class:
ja: プロトコル合成リストの各項目は以下のうちの１つです；リストは最大１つのクラスを含むことができます：

source: Each item in the dictionary is returned as a (key, value) tuple when the dictionary is iterated, and you can decompose the (key, value) tuple’s members as explicitly named constants for use within the body of the for-in loop.
ja: 辞書の中の各項目は、辞書が繰り返されるとき、(key, value)タプルとして返されます、そしてあなたは(key, value)タプルの構成要素をfor-inループの本文内で使用するわかりやすい名前の定数として分解することができます。

source: Each item in the dictionary is returned as a (key, value) tuple, and you can decompose the tuple’s members into temporary constants or variables as part of the iteration:
ja: 辞書の中の各項目は、(key, value)タプルとして返されます、そしてあなたはタプルの構成要素を一時的な定数または変数に分解することが、この繰り返しの一部として行えます：

source: Each item that you insert into the string literal is wrapped in a pair of parentheses, prefixed by a backslash (\):
ja: あなたがリテラル文字列に差し込む各項目は、一対の丸括弧に包まれて、バックスラッシュ（\）を前に置かれます：

source: Each kind of expression is described in detail in the sections below.
ja: 各種類の式は、以下の節において詳細に記述されます。

source: Each of the comparison operators returns a Bool value to indicate whether or not the statement is true:
ja: それぞれの比較演算子は、Bool値を返して、その文が真かどうかを指し示します：

source: Each of these key-path components can be repeated as many times as needed, in any order.
ja: これらキーパス構成要素のそれぞれは、必要なだけ、任意の順序で、何度も繰り返されることができます。

source: Each pair of characters in a hexadecimal number uses 8 bits, so a move 16 places to the right will convert 0xCC0000 into 0x0000CC.
ja: 16進数の中の文字の各ペアは８ビットを使うので、右への16桁の移動は0xCC0000を0x0000CCへと変えます。

source: Each player has a certain number of coins stored in their purse at any time.
ja: 各々のプレーヤーは、特定の数のコインをいつでもかれらの財布に保管しておきます。

source: Each position in the matrix is given an initial value of 0.0.
ja: 行列の中の各位置は、0.0の初期値を与えられます。

source: Each raw value must be unique within its enumeration declaration.
ja: 生の値それぞれは、その列挙宣言の範囲内で固有でなければなりません。

source: Each statement in the body of a conditional compilation block is parsed even if it’s not compiled.
ja: 条件コンパイルブロックの本文中の各文は、たとえそれがコンパイルされなくとも、構文解析されます。

source: Each time swapTwoValues(_:_:) is called, the type to use for T is inferred from the types of values passed to the function.
ja: swapTwoValues(_:_:)が呼ばれるたびに、Tのために使われる型は関数に渡される値の型から推論されます。

source: Each time through the while loop, diceRoll is incremented by one and is then checked to see whether it has become too large.
ja: 毎回whileループの間、diceRollは１増やされて、それからそれが大きくなりすぎていないか調べられます。

source: Each turn, you roll a six-sided dice and move by that number of squares, following the horizontal path indicated by the dotted arrow above.
ja: 順番になるたび、あなたは六面のさいころを転がします、そしてその数だけ正方形を移動します、上の点線の矢印で示される水平移動の経路をたどっていきます。

source: Each type argument must satisfy all the constraints of the generic parameter it replaces, including any additional requirements specified in a generic where clause.
ja: 各型引数は、それが置き換える総称体パラメータの全ての制約を、総称体where節で指定される任意の追加の要件を含めて、満たさなければなりません。

source: Each type method is explicitly scoped to the type it supports.
ja: 各型メソッドは、当然ながらそれが支える型にスコープを指定されます。

source: Each unassigned case of type Int is implicitly assigned a raw value that is automatically incremented from the raw value of the previous case.
ja: 型Intの未割り当てのケース節それぞれは、暗黙のうちに生の値を割り当てられます、それは、前のケース節の生の値から自動的に増やされたものです。

source: Each value is associated with a unique key, which acts as an identifier for that value within the dictionary.
ja: 各値は固有のキーと結び付けられます、そして、それはその辞書の内部でその値のために識別子の働きをします。

source: Early Exit
ja: 早期退出

source: Effectively, the addition and the assignment are combined into one operator that performs both tasks at the same time.
ja: 実質的に、加算と代入は１つの演算子に結合され、同時に両方の作業を実行します。

source: Effectively, they are just two different names for the same single instance, as shown in the figure below:
ja: 事実上、それらは同じ１つのインスタンスに対する単なる２つの異なる名前です、以下の図で示されるように：

source: Empty array literals are written using an empty pair of square brackets and can be used to create an empty array of a specified type.
ja: 空の配列リテラルは、空の角括弧の対を使って書かれて、指定された型の空の配列をつくるために使われることができます。

source: Enforcing Preconditions
ja: 前提条件の遵守

source: Entities in the imported module that are marked with the internal access-level modifier are imported as if they were declared with the public access-level modifier.
ja: internalアクセス水準修飾子で印されるインポートされたモジュールの中の存在それらは、まるでそれらがpublicアクセス水準修飾子で宣言されたかのようにインポートされます。

source: Enumeration Case Pattern
ja: 列挙ケース節パターン

source: Enumeration Declaration
ja: 列挙宣言

source: Enumeration Syntax
ja: 列挙構文

source: Enumeration Types
ja: 列挙型

source: Enumeration case patterns appear in switch statement case labels and in the case conditions of if, while, guard, and for-in statements.
ja: 列挙ケース節パターンは、switch文のケース節ラベル（ケース節表記）において、そしてif、while、guard、およびfor-in文のケース節条件において現れます。

source: Enumeration case values without associated values (as described in Enumerations) are also hashable by default.
ja: 関連値なしでの列挙ケース節の値（列挙で記述されます）もまた、そのままでハッシュ化できます。

source: Enumeration cases that store associated values can be used as functions that create instances of the enumeration with the specified associated values.
ja: 関連値を格納する列挙ケース節は、関数として使われることができ、それは指定された関連値を持つその列挙のインスタンスを作成します。

source: Enumeration declarations can’t contain deinitializer or protocol declarations.
ja: 列挙宣言は、デイニシャライザまたはプロトコル宣言を含むことができません。

source: Enumeration declarations have two basic forms and are declared using the enum keyword.
ja: 列挙宣言は、２つの基本の形式を持ち、キーワードenumを使って宣言されます。

source: Enumeration types can adopt any number of protocols, but can’t inherit from classes, structures, or other enumerations.
ja: 列挙型は、任意の数のプロトコルに準拠することができます、しかしクラス、構造体、または他の列挙から継承することはできません。

source: Enumerations
ja: 列挙

source: Enumerations and Structures
ja: 列挙と構造体

source: Enumerations are often created to support a specific class or structure’s functionality.
ja: 列挙は、特定のクラスまたは構造体の機能性を支えるためにたびたびつくられます。

source: Enumerations can also define initializers to provide an initial case value; can be extended to expand their functionality beyond their original implementation; and can conform to protocols to provide standard functionality.
ja: 列挙は、さらに、最初のケース節値を提供するためにイニシャライザを定義することができます；それらの本来の実装を越えてそれらの機能性を広げるために拡張されることができます；そして、標準の機能性を提供するためにプロトコルに準拠することができます。

source: Enumerations can have a recursive structure, that is, they can have cases with associated values that are instances of the enumeration type itself.
ja: 列挙は、再帰構造を持つことができます、すなわち、それは、その列挙型それ自身のインスタンスである関連値を伴うケース節を持つことができます。

source: Enumerations declared in this form are sometimes called discriminated unions in other programming languages.
ja: この形式で宣言される列挙は、時として他のプログラミング言語では判別共用体と呼ばれています。

source: Enumerations in Swift are first-class types in their own right.
ja: スウィフトの列挙は、れっきとした第一級の型です。

source: Enumerations in Swift are much more flexible, and don’t have to provide a value for each case of the enumeration.
ja: スウィフトの列挙は、ずっと柔軟で、列挙のケース節の各々に値を与える必要はありません。

source: Enumerations similar to these are known as discriminated unions, tagged unions, or variants in other programming languages.
ja: これに似ている列挙は、他のプログラミング言語で判別共用体、タグ付き共用体、またはバリアントとして知られています。

source: Enumerations that have cases of a raw-value type implicitly conform to the RawRepresentable protocol, defined in the Swift standard library.
ja: 「生の値」型のケース節を持つ列挙は、スウィフト標準ライブラリで定義されるRawRepresentableプロトコルに暗黙的に準拠します。

source: Enumerations that have no associated types
ja: 関連型を持たない列挙

source: Enumerations that have only associated types that conform to the Equatable protocol
ja: Equatableプロトコルに準拠する関連型だけを持つ列挙

source: Enumerations with Cases of Any Type
ja: 随意の型のケース節をもつ列挙

source: Enumerations with Cases of a Raw-Value Type
ja: 「生の値」型のケース節を持つ列挙

source: Enumerations with Indirection
ja: 間接参照を持つ列挙

source: Enumerations with raw values automatically receive a failable initializer, init?(rawValue:), that takes a parameter called rawValue of the appropriate raw-value type and selects a matching enumeration case if one is found, or triggers an initialization failure if no matching value exists.
ja: 生の値を持つ列挙は、自動的にひとつの失敗できるイニシャライザ、init?(rawValue:)を受け取ります、それは、適切な「生の値」型のrawValueと呼ばれるパラメータを取って、適合する列挙ケース節をそれが見つかったならば選択します、または適合する値が存在しないならば初期化失敗を引き起こします。

source: Enumerations with raw values now have a rawValue property rather than a toRaw() method and a failable initializer with a rawValue parameter rather than a fromRaw() method.
ja: 生の値を持つ列挙は、今ではtoRaw()メソッドではなくrawValueプロパティを、そしてfromRaw()メソッドではなくrawValueパラメーターを使う失敗できるイニシャライザを持ちます。

source: Equal to (a == b)
ja: 同等である (a == b)

source: Equivalence Operators
ja: 等価演算子

source: Error Handling
ja: エラーの処理

source: Error handling allows controlled recovery from unexpected failures.
ja: エラー処理が、予期せぬ失敗からの制御された復旧を可能にする。

source: Error handling in Swift interoperates with error handling patterns that use the NSError class in Cocoa and Objective-C.
ja: スウィフトでのエラー処理は、CocoaとObjective-CでのNSErrorクラスを使うエラー処理パターンと相互運用性があります。

source: Error handling in Swift resembles exception handling in other languages, with the use of the try, catch and throw keywords.
ja: スウィフトにおけるエラー処理は、try、catch、そしてthrowキーワードの使用とともに、他の言語での例外処理に似ています。

source: Escaping Closures
ja: 脱出クロージャ

source: Evaluating an expression returns a value, causes a side effect, or both.
ja: ある式を評価することは、ひとつの値を返す、ある副作用を引き起こす、あるいはその両方です。

source: Even if your source file has a mix of carriage returns and line feeds, all of the line breaks in the string will be the same.
ja: たとえあなたのソースファイルがキャリッジリターンとラインフィードの混合を持つとしても、文字列の中のラインブレークの全ては同じになります。

source: Even on 32-bit platforms, Int can store any value between -2,147,483,648 and 2,147,483,647, and is large enough for many integer ranges.
ja: 32ビットのプラットホーム上でさえ、Intは-2,147,483,648と2,147,483,647の間のどんな値でも格納することができ、多くの整数範囲のために十分に大きいです。

source: Even though Rank and Suit are nested within BlackjackCard, their type can be inferred from context, and so the initialization of this instance is able to refer to the enumeration cases by their case names (.ace and .spades) alone.
ja: たとえRankとSuitがBlackjackCard内部に入れ子にされるとしても、それらの型は前後関係から推論されることができます、なのでこのインスタンスの初期化は、列挙ケース節を参照することがもっぱらそれらのケース節名（.aceと.spades）のみによって可能です。

source: Even though RecipeIngredient provides the init(name: String) initializer as a convenience initializer, RecipeIngredient has nonetheless provided an implementation of all of its superclass’s designated initializers.
ja: たとえRecipeIngredientが便宜イニシャライザとしてinit(name: String)イニシャライザを提供するとしても、RecipeIngredientはそれでもやはりそれのスーパークラスの指定イニシャライザの全ての実装を提供しました。

source: Even though hd and cinema now have the same width and height, they are two completely different instances behind the scenes.
ja: たとえhdとcinemaが現在同じ幅と高さを持つとしても、それらは舞台裏では２つの完全に異なるインスタンスです。

source: Even though the text property is now a constant, it can still be set within the class’s initializer:
ja: たとえtextプロパティが今や定数であるとしても、それはクラスのイニシャライザの内部ではまだ設定されることができます：

source: Even though the closure refers to self multiple times, it only captures one strong reference to the HTMLElement instance.
ja: たとえクロージャが複数回selfに言及するとしても、それはそのHTMLElementインスタンスへの１つの強い参照を捕獲するだけです。

source: Even though the first element of the customersInLine array is removed by the code inside the closure, the array element isn’t removed until the closure is actually called.
ja: たとえcustomersInLine配列の最初の要素がクロージャ内部のコードによって取り除かれるとしても、その配列要素はクロージャが実際に呼び出されるまで実行されません。

source: Even though the stack and the array are of a different type, they both conform to the Container protocol, and both contain the same type of values.
ja: たとえスタックと配列が異なる型であるとしても、それらは両方ともContainerプロトコルに準拠して、両方とも同じ型の値を含みます。

source: Even though the two write accesses overlap in time, they don’t conflict.
ja: たとえ２つの書き込みアクセスが時間内にオーバーラップしても、それらは衝突しません。

source: Even though the variable protocolValue has a runtime type of SimpleClass, the compiler treats it as the given type of ExampleProtocol.
ja: たとえ変数protocolValueが実行時の型としてSimpleClassを持つとしても、コンパイラはそれを与えられた型ExampleProtocolとみなします。

source: Even though there are two optional chaining operations, one after another, the result is still wrapped in a single optional.
ja: たとえ２つのオプショナル連鎖演算があったとしても、後から後から、その結果は依然としてただ１つのオプショナルの中にラップされます。

source: Even though you don’t write an explicit getter and setter for a stored property, Swift still synthesizes an implicit getter and setter for you to provide access to the stored property’s backing storage.
ja: たとえあなたが格納プロパティのために明確なゲッターとセッターを書かないとしても、スウィフトは格納プロパティのもつ支援外部記憶へのアクセスを提供するためにあなたのためにまだ暗黙のゲッターとセッターを総合的に扱います。

source: Every Person instance has a name property of type String and an optional apartment property that is initially nil.
ja: あらゆるPersonインスタンスは、型Stringのnameプロパティと初期時にはnilであるオプショナルのapartmentプロパティを持ちます。

source: Every switch statement consists of multiple possible cases, each of which begins with the case keyword.
ja: あらゆるswitch文は複数の起こりうるケース節から成ります。そして、それぞれはcaseキーワードから始まります。

source: Every switch statement must be exhaustive.
ja: あらゆるswitch文は、網羅的でなければなりません。

source: Every class must have at least one designated initializer.
ja: あらゆるクラスは、少なくとも１つの指定イニシャライザを持たなければなりません。

source: Every conditional compilation block begins with the #if compilation directive and ends with the #endif compilation directive.
ja: すべての条件コンパイルブロックは、#ifコンパイル指令で始まって、#endifコンパイル指令で終わります。

source: Every function has a function name, which describes the task that the function performs.
ja: あらゆる関数は関数名を持ち、それはその関数が実行する作業を形容します。

source: Every function has a specific function type, made up of the parameter types and the return type of the function.
ja: あらゆる関数は特定の関数型を持ちます、それは、その関数のパラメータ型と戻り型から成り立ちます。

source: Every function in Swift has a type, consisting of the function’s parameter types and return type.
ja: スウィフトのあらゆる関数は、その関数のパラメータ型と戻り型から成る、ある型を持ちます。

source: Every instance of Swift’s Character type represents a single extended grapheme cluster.
ja: スウィフトのCharacter型の全てのインスタンスは、単一の拡張書記素クラスタ（房、群）を表わします。

source: Every instance of a type has an implicit property called self, which is exactly equivalent to the instance itself.
ja: ある型のすべてのインスタンスは、暗黙的にselfと呼ばれるプロパティを持ちます、それは、正確にそのインスタンスそれ自身に等しいです。

source: Every item in the shopping list starts out as “unpurchased”.
ja: 購入品目リストでのあらゆる項目は、「未購入」として始まります。

source: Every property needs a value assigned—either in its declaration (as with numberOfSides) or in the initializer (as with name).
ja: あらゆるプロパティは、代入される値を必要とします ― その宣言において（numberOfSidesでのように）またはイニシャライザにおいて（nameでのように）のどちらでも。

source: Every string is composed of encoding-independent Unicode characters, and provides support for accessing those characters in various Unicode representations.
ja: あらゆる文字列は、符号化に依存しないUnicode文字から構成されます、そして多彩なUnicode表現においてそのような文字にアクセスするための支援を提供します。

source: Every time a player finishes a level, that level is unlocked for all players on the device.
ja: プレーヤーがあるレベルを終了するごとに、そのレベルはその装置上の全てのプレーヤーのために鍵を外されます。

source: Every time you create a new instance of a class, ARC allocates a chunk of memory to store information about that instance.
ja: あなたがクラスの新しいインスタンスをつくるたびに、ARCはメモリのある量を割り当てて、そのインスタンスに関する情報を格納します。

source: Every time you create a new instance of that type, it has its own set of property values, separate from any other instance.
ja: あなたがその型の新しいインスタンスをつくるたびに、それは、他のあらゆるインスタンスから独立した、独自のひと組のプロパティ値を持ちます。

source: Examples of Closure Expressions now use the global sorted(_:_:) function rather than the global sort(_:_:) function, to reflect the new array value semantics.
ja: クロージャ式の例は、現在はグローバルなsorted(_:_:)関数を、グローバルなsort(_:_:)関数のかわりに使用します、それによって新しい配列値意味論を反映します。

source: Executing the last defer statement in a given scope first means that statements inside that last defer statement can refer to resources that will be cleaned up by other defer statements.
ja: ある特定のスコープ中の最後のdefer文の実行が最初であることは、その最後のdefer文内の文は別のdefer文によってクリーンアップされることになるリソースを参照できるのを意味します。

source: Execution Does Not Fall Through Cases Implicitly
ja: 実行は暗黙のうちにケース節を抜け落ちません

source: Execution doesn’t continue to the next case, so there is no need to explicitly break out of the switch at the end of each case’s code.
ja: 実行は次の条件部分に続かないので、各条件部分のコードの終わりで明示的にスイッチから抜け出す必要はありません。

source: Existing bits are moved to the left or right by the requested number of places.
ja: 既存のビットは、左または右へ要請された桁数だけ動かされます。

source: Existing instances of a type automatically adopt and conform to a protocol when that conformance is added to the instance’s type in an extension.
ja: ある型の既存のインスタンスたちは、そのインスタンスの型に拡張の中で準拠が加えられるとき、そのプロトコルを自動的に採用して準拠します。

source: Experiment
ja: 試してください

source: Explicit Member Expression
ja: 明示的メンバー式

source: Explicit Parentheses
ja: 明確な括弧

source: Exposing detailed information about the creation of a shape allows types that aren’t meant to be part of the ASCII art module’s public interface to leak out because of the need to state the full return type.
ja: ある形状の作成についての詳細な情報を露出することは、ASCIIアートモジュールのもつパブリックインターフェイスの一部であることを意図する型それらに漏れ出ていくのを許します、完全な戻り型を公表する必要があるのが原因で。

source: Expression Pattern
ja: 式パターン

source: Expression patterns appear only in switch statement case labels.
ja: 式パターンは、switch文のケース節ラベルにおいてのみ現れます。

source: Expressions
ja: 式

source: Extended Grapheme Clusters
ja: 拡張書記素クラスタ

source: Extended String Delimiters
ja: 拡張文字列区切り記号

source: Extended grapheme clusters are a flexible way to represent many complex script characters as a single Character value.
ja: 拡張書記素クラスタは、多くの複雑な書き方の文字を単一のCharacter値として表わす適応性に富む方法です。

source: Extended grapheme clusters are canonically equivalent if they have the same linguistic meaning and appearance, even if they’re composed from different Unicode scalars behind the scenes.
ja: 拡張書記素クラスタが正準等価であるのは、それらが同じ言語的な意味と外観を持つ場合です、たとえそれらが舞台裏で異なるユニコードスカラーから組み立てられるとしてもです。

source: Extended grapheme clusters can be composed of multiple Unicode scalars.
ja: 拡張書記素クラスタは、多数のユニコード・スカラーから構成される可能性があります。

source: Extended grapheme clusters enable scalars for enclosing marks (such as COMBINING ENCLOSING CIRCLE, or U+20DD) to enclose other Unicode scalars as part of a single Character value:
ja: 拡張書記素クラスタは、囲み記号としてのスカラー（COMBINING ENCLOSING CIRCLE、またはU+20DD）を可能にして、単一のCharacter値の一部として他のユニコード・スカラーを囲み入れます。

source: Extending a Generic Type
ja: 総称体型を拡張する

source: Extending an Existing Type to Specify an Associated Type
ja: 既存の型を拡張して関連型を指定する

source: Extending existing types to provide initializers that accept new types (including your own type definitions) is covered in Extensions.
ja: 新しい型（あなた独自の型定義を含む）を受け入れるイニシャライザを提供するように既存の型を拡張することは、「拡張」で扱われます。

source: Extension Declaration
ja: 拡張宣言

source: Extension Syntax
ja: 拡張構文

source: Extension declarations are declared using the extension keyword and have the following form:
ja: 拡張宣言は、キーワードextensionキーワードを使って宣言され、以下の形式を持ちます：

source: Extension declarations can add protocol conformance to an existing class, structure, or enumeration type by specifying adopted protocols:
ja: 拡張宣言は、プロトコル準拠を既存のクラス、構造体、または列挙型に加えることがadopted protocols 採用プロトコルを指定することによって可能です：

source: Extension declarations can contain initializer declarations.
ja: 拡張宣言は、イニシャライザ宣言を含むことができます。

source: Extension declarations can’t add class inheritance to an existing class, and therefore you can specify only a list of protocols after the type name and colon.
ja: 拡張宣言は、クラス継承を既存のクラスに加えることができません、従ってあなたは幾らかのプロトコルからなるリストのみをtype name 型名とコロンの後に指定することができます。

source: Extension declarations can’t contain deinitializer or protocol declarations, stored properties, property observers, or other extension declarations.
ja: 拡張宣言は、デイニシャライザまたはプロトコル宣言、格納プロパティ、プロパティオブザーバー、または他の拡張宣言を含むことができません。

source: Extension declarations that extend a generic type or a protocol with associated types can include requirements.
ja: 総称体型またはプロトコルを関連型で拡張する拡張宣言は、requirements いくつかの要件を含むことができます。

source: Extensions
ja: 拡張

source: Extensions are similar to categories in Objective-C.
ja: 拡張は、Objective-Cでのカテゴリーに似ています。

source: Extensions can add computed instance properties and computed type properties to existing types.
ja: 拡張は、既存の型に計算インスタンスプロパティと計算型プロパティを加えることができます。

source: Extensions can add new computed properties, but they cannot add stored properties, or add property observers to existing properties.
ja: 拡張は新しい計算プロパティを加えることができます、しかし、それは格納プロパティを加えることができません、またプロパティオブザーバーを既存のプロパティに加えることができません。

source: Extensions can add new convenience initializers to a class, but they cannot add new designated initializers or deinitializers to a class.
ja: 拡張は、新しい便利なイニシャライザをクラスに加えることができます、しかし、それは新しい指定イニシャライザまたはデイニシャライザをクラスに加えることができません。

source: Extensions can add new functionality to a type, but they cannot override existing functionality.
ja: 拡張は、新しい機能性をある型に加えることができます、しかしそれは既存の機能性をオーバーライドすることはできません。

source: Extensions can add new initializers to existing types.
ja: 拡張は、新しいイニシャライザを既存の型に加えることができます。

source: Extensions can add new instance methods and type methods to existing types.
ja: 拡張は、新しいインスタンスメソッドと型メソッドを既存の型に加えることができます。

source: Extensions can add new nested types to existing classes, structures, and enumerations:
ja: 拡張は、新しい入れ子にされた型を既存のクラス、構造体、および列挙に加えることができます：

source: Extensions can add new properties, methods, and subscripts to an existing type, and are therefore able to add any requirements that a protocol may demand.
ja: 拡張は、新しいプロパティ、メソッド、そして添え字を既存の型に加えることができます、したがって、あるプロトコルが要求するであろうどんな要件でも加えることができます。

source: Extensions can add new subscripts to an existing type.
ja: 拡張は、新しい添え字を既存の型に加えることができます。

source: Extensions in Swift can:
ja: スウィフトの拡張は、以下が可能です：
